
ส่วนโค้ดของกราฟ

    ส่วนเเรกนะครับ เป็นส่วนของการ import function ต่างๆ ในที่นี้จะ import pandas
    เอาไว้สำหรับอ่านไฟล์ csv เเละจัดการข้อมูลเพื่อเอาไปพอทกราฟนะครับ
    เเละเราได้ import pygal มาไว้สำหรับพอทกราฟข้อมูลของเรา

    ส่วนที่สองจะเป็นการตกเเต่งกราฟ โดยเราจะเปลี่ยนสีพื้นหลังกับเปลี่ยนสีกราฟให้มีสีที่น่าสนใจมากยิ่งขึ้น

    ส่วนที่สามจะเป็นการจัดการข้อมูลเเละทำข้อมูลให้ออกมาเป็นlistเพื่อที่จะได้ง่ายต่อการนำไปพอทกราฟต่อไป

    ส่วนที่สี่ จะเป็นขั้นตอนการพอทกราฟ โดยจะใส่ข้อมูลเข้าไปในกราฟ ใส่หัวข้อกราฟเเละข้อมูลเพิ่มเติมต่ใส่หัวข้อกราฟเเละข้อมูลเพิ่มเติมต่างๆลงไป

ส่วนของกราฟ

    จากกราฟพบว่า มูลค่าทองคำในช่วงปี ค.ศ.1950 - 1970 นั้น ไม่มีความเปลี่ยนมาก
    มีมูลค่าอยูในช่วง 35-37 ดอลลาร์สหรัฐ เเละต่อมาในช่วงปี ค.ศ. 1974 ถึง 1996
    มูลค่าทองคำนั้นสูงขึ้นสูงสุด อยู่ที่ 596 ดอลลาร์สหรัฐ จนปี ค.ศ. 2012 มูลค่าทองคำนั้นขึ้นสูงสุด
    ในรอบ 50 ปี มีมูลค่าสูงถึง 1,687 ดอลลาร์สหรัฐ

ส่วนของเว็บ

    พูดตามในเว็บเลยว่ามีอะไรบ้าง หัวข้อ ปัจจัยว่ามีอะไรบ้าง เเล้วก็กดๆเว็บให้ดูว่าลิ้งอะไรไว้บ้างง  จอบออ
